ksekimoto/llvm-project/llvm/lib/Target/RL78/MCTargetDesc/RL78MCExpr.cpp
//===-- RL78MCExpr.cpp - RL78 specific MC expression classes --------===//
//
// Part of the LLVM Project, under the Apache License v2.0 with LLVM Exceptions.
// See https://llvm.org/LICENSE.txt for license information.
// SPDX-License-Identifier: Apache-2.0 WITH LLVM-exception
//
//===----------------------------------------------------------------------===//
//
// This file contains the implementation of the assembly expression modifiers
// accepted by the RL78 architecture (e.g. "%hi", "%lo", ...).
//
//===----------------------------------------------------------------------===//

#include "RL78MCExpr.h"
#include "RL78.h"
#include "llvm/BinaryFormat/ELF.h"
#include "llvm/MC/MCContext.h"
#include "llvm/MC/MCObjectStreamer.h"
#include "llvm/MC/MCSymbolELF.h"
#include "llvm/MC/MCValue.h"
#include <set>

using namespace llvm;

#define DEBUG_TYPE "RL78mcexpr"

const RL78MCExpr *RL78MCExpr::create(VariantKind Kind, const MCExpr *Expr,
                                     MCContext &Ctx) {
  if (Kind == VK_RL78_BITPOSITIONAL) {
    if (Expr->getKind() != MCExpr::ExprKind::Binary)
      llvm_unreachable("Bad VK_RL78_BITPOSITIONAL expression");
    const MCBinaryExpr *BinExpr = cast<MCBinaryExpr>(Expr);
    return new (Ctx) RL78MCExpr(Kind, BinExpr->getLHS(), BinExpr->getRHS());
  }
  return new (Ctx) RL78MCExpr(Kind, Expr);
}

void RL78MCExpr::printImpl(raw_ostream &OS, const MCAsmInfo *MAI) const {
  bool closeParen = printVariantKind(OS, VKind);

  const MCExpr *Expr = getSubExpr();
  Expr->print(OS, MAI);

  if (closeParen)
    OS << ')';
}

bool RL78MCExpr::printVariantKind(raw_ostream &OS, VariantKind Kind) {
  bool closeParen = true;
  switch (Kind) {
  default:
    closeParen = false;
    break;
  case VK_RL78_HIGH:
    OS << "HIGH(";
    break;
  case VK_RL78_LOW:
    OS << "LOW(";
    break;
  case VK_RL78_HIGHW:
    OS << "HIGHW(";
    break;
  case VK_RL78_LOWW:
    OS << "LOWW(";
    break;
  case VK_RL78_MIRHW:
    OS << "MIRHW(";
    break;
  case VK_RL78_MIRLW:
    OS << "MIRLW(";
    break;
  case VK_RL78_SMRLW:
    OS << "SMRLW(";
    break;
  case VK_RL78_STARTOF:
    OS << "STARTOF(";
    break;
  case VK_RL78_SIZEOF:
    OS << "SIZEOF(";
    break;
  }
  return closeParen;
}

bool RL78MCExpr::getFixupForKind(RL78MCExpr::VariantKind Kind, RL78::Fixups &Fixup,
                                         bool IsPopPush, unsigned FixupFromOp) {
  switch (Kind) {
  default:
    return false;
  case VK_RL78_SADW:
    if (IsPopPush)
      // Can't be PopPush, since we are generating it in a single place
      return false;
    else {
      // Allow the op to decide between fixup_RL78_DIR8UW_SAD
      //  and fixup_RL78_DIR8U_SAD
      Fixup = (RL78::Fixups)FixupFromOp;
      return true;
    }
  case VK_RL78_HIGH:
    if (IsPopPush)
      Fixup = RL78::fixup_RL78_OPABSlowH;
    else
      Fixup = RL78::fixup_RL78_OPlowH;
    return true;
  case VK_RL78_LOW:
    if (IsPopPush)
      Fixup = RL78::fixup_RL78_OPABSlowL;
    else
      Fixup = RL78::fixup_RL78_OPlowL;
    return true;
  case VK_RL78_HIGHW:
    if (IsPopPush)
      Fixup = RL78::fixup_RL78_OPABShighW;
    else
      Fixup = RL78::fixup_RL78_OPhighW;
    return true;
  case VK_RL78_LOWW:
    if (IsPopPush)
      Fixup = RL78::fixup_RL78_OPABSlowW;
    else
      Fixup = RL78::fixup_RL78_OPlowW;
    return true;
  case VK_RL78_MIRHW:
    if (IsPopPush) // TODO detect this at parsing stage?
      return false;
    else
      Fixup = RL78::fixup_RL78_OPhighW_MIR;
    return true;
  case VK_RL78_MIRLW:
    if (IsPopPush) // TODO detect this at parsing stage?
      return false;
    else
      Fixup = RL78::fixup_RL78_OPlowW_MIR;
    return true;
  case VK_RL78_SMRLW:
    if (IsPopPush) // TODO detect this at parsing stage?
      return false;
    Fixup = RL78::fixup_RL78_OPlowW_SMIR;
    return true;
  case VK_RL78_STARTOF:
    if (IsPopPush) // TODO detect this at parsing stage?
      return false;
    else
      Fixup = RL78::fixup_RL78_OPscttop;
    return true;
  case VK_RL78_SIZEOF:
    if (IsPopPush)
      return false;
    else
      Fixup = RL78::fixup_RL78_OPsctsize;
    return true;
  case VK_RL78_FUNCTION:
    if (IsPopPush)
      return false;
    else
      Fixup = RL78::fixup_RL78_DIR16U;
    return true;
  }
}

bool GetAbsValueForVariant(RL78MCExpr::VariantKind Kind, int64_t &AbsVal) {
  switch (Kind) {
  default:
    llvm_unreachable("Unhandled RL78MCExpr::VariantKind");
  case RL78MCExpr::VK_RL78_None:
    llvm_unreachable("VK_RL78_None is invalid");
  case RL78MCExpr::VK_RL78_HIGH:
    AbsVal = (AbsVal >> 8) & 0xFF;
    break;
  case RL78MCExpr::VK_RL78_LOW:
    AbsVal = AbsVal & 0xFF;
    break;
  case RL78MCExpr::VK_RL78_HIGHW:
  // TODO: for now we emit a warning and treat it like HIGHW
  case RL78MCExpr::VK_RL78_MIRHW:
    AbsVal = (AbsVal >> 16) & 0xFFFF;
    break;
  case RL78MCExpr::VK_RL78_LOWW:
  case RL78MCExpr::VK_RL78_SMRLW:
  // TODO: for VK_RL78_MIRLW we emit a warning and treat it like LOWW
  // CC-RL uses the device file to know the mirror start address and to
  // correctly transform this.
  case RL78MCExpr::VK_RL78_MIRLW:
    AbsVal = AbsVal & 0xFFFF;
    break;
  case RL78MCExpr::VK_RL78_STARTOF:
  case RL78MCExpr::VK_RL78_SIZEOF:
  case RL78MCExpr::VK_RL78_BITPOSITIONAL:
    return false;
  }
  return true;
}


bool RL78MCExpr::evaluateAsRelocatableImpl(MCValue &Res,
                                           const MCAsmLayout *Layout,
                                           const MCFixup *Fixup) const {

  bool subExprRelocatable =
      getSubExpr()->evaluateAsRelocatable(Res, Layout, Fixup);
  if (!subExprRelocatable)
    return false;

  // evaluateAsAbsolute() and evaluateAsValue() require that we evaluate the
  // %hi/%lo/etc. here. Fixup is a null pointer when either of these is the
  // caller.
  if (Res.isAbsolute() && Fixup == nullptr) {
    int64_t AbsVal = Res.getConstant();
   if(!GetAbsValueForVariant(VKind, AbsVal))
       return false;
    Res = MCValue::get(AbsVal);
    return true;
  }

  if (VKind == VariantKind::VK_RL78_IMM_SYM) {
    Res = MCValue::get(cast<MCSymbolRefExpr>(getSubExpr()), nullptr, 0, VKind);
    return true;
  }

