ksekimoto/llvm-project/llvm/lib/Target/RL78/MCTargetDesc/RL78MCExpr.cpp
  // We want to defer it for relocatable expressions since the constant is
  // applied to the whole symbol value.
  //
  // The value of getKind() that is given to MCValue is only intended to aid
  // debugging when inspecting MCValue objects. It shouldn't be relied upon
  // for decision making.
  Res =
      MCValue::get(Res.getSymA(), Res.getSymB(), Res.getConstant(), VKind);

  return true;
}

static void fixELFSymbolsInTLSFixupsImpl(const MCExpr *Expr, MCAssembler &Asm) {
  switch (Expr->getKind()) {
  case MCExpr::Target:
    llvm_unreachable("Can't handle nested target expr!");
    break;

  case MCExpr::Constant:
    break;

  case MCExpr::Binary: {
    const MCBinaryExpr *BE = cast<MCBinaryExpr>(Expr);
    fixELFSymbolsInTLSFixupsImpl(BE->getLHS(), Asm);
    fixELFSymbolsInTLSFixupsImpl(BE->getRHS(), Asm);
    break;
  }

  case MCExpr::SymbolRef: {
    const MCSymbolRefExpr &SymRef = *cast<MCSymbolRefExpr>(Expr);
    cast<MCSymbolELF>(SymRef.getSymbol()).setType(ELF::STT_TLS);
    break;
  }

  case MCExpr::Unary:
    fixELFSymbolsInTLSFixupsImpl(cast<MCUnaryExpr>(Expr)->getSubExpr(), Asm);
    break;
  }
}

void RL78MCExpr::fixELFSymbolsInTLSFixups(MCAssembler &Asm) const {
  // fixELFSymbolsInTLSFixupsImpl(getSubExpr(), Asm);
}

void RL78MCExpr::visitUsedExpr(MCStreamer &Streamer) const {
  Streamer.visitUsedExpr(*getSubExpr());
}

bool RL78MCExpr::isTargetExpr(const MCExpr *expression) {
  switch (expression->getKind())
  {
  case MCExpr::Target:
          return true;
  case MCExpr::Binary: {
      const MCBinaryExpr *BinaryExpr = static_cast<const MCBinaryExpr *>(expression);
      return isTargetExpr(BinaryExpr->getLHS()) || 
             isTargetExpr(BinaryExpr->getRHS());
  }
  case MCExpr::Unary: {
      const MCUnaryExpr *UnaryExpr = static_cast<const MCUnaryExpr *>(expression);
      return isTargetExpr(UnaryExpr->getSubExpr());
  }
  default:
    return false;   
  }
}

bool ExecuteOperation(int64_t &Result, int64_t LHS, int64_t RHS,
                      MCBinaryExpr::Opcode Op) {
  switch (Op) {
  case MCBinaryExpr::AShr:
    Result = LHS >> RHS;
    break;
  case MCBinaryExpr::Add:
    Result = LHS + RHS;
    break;
  case MCBinaryExpr::And:
    Result = LHS & RHS;
    break;
  case MCBinaryExpr::Div:
    if (RHS == 0)
      return false;
    Result = LHS / RHS;
    break;
  case MCBinaryExpr::Mod:
    if (RHS == 0)
      return false;
    Result = LHS % RHS;
    break;
  case MCBinaryExpr::EQ:
    Result = LHS == RHS;
    break;
  case MCBinaryExpr::GT:
    Result = LHS > RHS;
    break;
  case MCBinaryExpr::GTE:
    Result = LHS >= RHS;
    break;
  case MCBinaryExpr::LAnd:
    Result = LHS && RHS;
    break;
  case MCBinaryExpr::LOr:
    Result = LHS || RHS;
    break;
  case MCBinaryExpr::LShr:
    Result = uint64_t(LHS) >> uint64_t(RHS);
    break;
  case MCBinaryExpr::LT:
    Result = LHS < RHS;
    break;
  case MCBinaryExpr::LTE:
    Result = LHS <= RHS;
    break;
  case MCBinaryExpr::Mul:
    Result = LHS * RHS;
    break;
  case MCBinaryExpr::NE:
    Result = LHS != RHS;
    break;
  case MCBinaryExpr::Or:
    Result = LHS | RHS;
    break;
  case MCBinaryExpr::Shl:
    Result = uint64_t(LHS) << uint64_t(RHS);
    break;
  case MCBinaryExpr::Sub:
    Result = LHS - RHS;
    break;
  case MCBinaryExpr::Xor:
    Result = LHS ^ RHS;
    break;
  default:
    return false;
  }
  return true;
}

bool RL78MCExpr::FoldBitPositionalExpression(const MCExpr *Value,
                                             MCValue &AddressValue,
                                             int64_t &BitPosition,
                                             MCContext &Ctx) {
  // At this point we assume that somewhere in the expression there is a bit
  // positional.
  switch (Value->getKind()) {
  case MCExpr::Target: {
    const RL78MCExpr *TargetExpr = static_cast<const RL78MCExpr *>(Value);
    if (TargetExpr->getVariantKind() == VK_RL78_BITPOSITIONAL) {
      return TargetExpr->getBitPositionalAddressSubExpr()
                 ->evaluateAsRelocatable(AddressValue, nullptr, nullptr) &&
             TargetExpr->getBitPositionalBitPostionSubExpr()
                 ->evaluateAsAbsolute(BitPosition);
    }
    break;
  }
  case MCExpr::Binary: {
    const MCBinaryExpr *BinaryExpr = static_cast<const MCBinaryExpr *>(Value);
    MCBinaryExpr::Opcode Op = BinaryExpr->getOpcode();
    // The order counts:
    // Const + Addr.Bitpos -> (Const + Addr).Bitpos
    // Addr.Bitpos + Const  -> Addr.(Bitpos + Const)

    MCValue RHSAddressValue, LHSAddressValue;
    int64_t RHSBitPosition = -1, LHSBitPosition = -1;
    int64_t AbsAddress;

    if (FoldBitPositionalExpression(BinaryExpr->getRHS(), RHSAddressValue,
                                    RHSBitPosition, Ctx) &&
        FoldBitPositionalExpression(BinaryExpr->getLHS(), LHSAddressValue,
                                    LHSBitPosition, Ctx)) {

      // Forbidden combinations:
      // A1.X OpCode A2.X
      // A1.X OpCode Sym
      // Sym AnyOpExceptSub Sym.B
      // If we have a bit position, but RHS/LHS finds another
      if (LHSBitPosition != -1 && RHSBitPosition != -1 ||
          LHSBitPosition != -1 && !RHSAddressValue.isAbsolute() ||
          !LHSAddressValue.isAbsolute() && !RHSAddressValue.isAbsolute() &&
              Op != MCBinaryExpr::Sub ||
          BitPosition != -1 && (LHSBitPosition != -1 || RHSBitPosition != -1))
        return false;

      BitPosition = RHSBitPosition != -1 ? RHSBitPosition : LHSBitPosition;

      if (LHSBitPosition == -1) {
        if (LHSAddressValue.isAbsolute() && RHSAddressValue.isAbsolute() &&
            ExecuteOperation(AbsAddress, LHSAddressValue.getConstant(),
                             RHSAddressValue.getConstant(), Op)) {
          // Const AnyOp Const(.B)
          AddressValue = MCValue::get(AbsAddress);
          return true;
        } else if (LHSAddressValue.isAbsolute() &&
                   !RHSAddressValue.isAbsolute() && Op == MCBinaryExpr::Add) {
          // Const + Sym(.B)
          AddressValue = MCValue::get(
              RHSAddressValue.getSymA(), RHSAddressValue.getSymB(),
              RHSAddressValue.getConstant() + LHSAddressValue.getConstant());
          return true;
        } else if (!LHSAddressValue.isAbsolute() &&
                   RHSAddressValue.isAbsolute() && Op == MCBinaryExpr::Sub) {
          // Sym - Const(.B)
          AddressValue = MCValue::get(
              LHSAddressValue.getSymA(), LHSAddressValue.getSymB(),
              LHSAddressValue.getConstant() - RHSAddressValue.getConstant());
          return true;
        }
      }

      if (!LHSAddressValue.isAbsolute() && !RHSAddressValue.isAbsolute() &&
          Op == MCBinaryExpr::Sub && !LHSAddressValue.getSymB() &&
          !RHSAddressValue.getSymB() && LHSBitPosition == -1) {
        // Sym - Sym(.B)
        AddressValue = MCValue::get(
            LHSAddressValue.getSymA(), RHSAddressValue.getSymA(),
            LHSAddressValue.getConstant() - RHSAddressValue.getConstant());
        BitPosition = RHSBitPosition;
        return true;
      }

      // SYM.B OpCode Const
      if (LHSBitPosition != -1 &&
          ExecuteOperation(BitPosition, LHSBitPosition,
                           RHSAddressValue.getConstant(), Op)) {
        AddressValue = LHSAddressValue;
        return true;
      }

      // Const + Const.B
      if (RHSBitPosition != -1 && LHSAddressValue.isAbsolute() &&
          RHSAddressValue.isAbsolute() &&
          ExecuteOperation(AbsAddress, LHSAddressValue.getConstant(),
                           RHSAddressValue.getConstant(), Op)) {
        AddressValue = MCValue::get(AbsAddress);
        return true;
      }
    }
    return false;
  }
  case MCExpr::Unary: {
    const MCUnaryExpr *UnaryExpr = static_cast<const MCUnaryExpr *>(Value);
    // we ignore the +, but error out on any other
    if (UnaryExpr->getOpcode() == MCUnaryExpr::Plus) {
      return FoldBitPositionalExpression(UnaryExpr->getSubExpr(), AddressValue,
                                         BitPosition, Ctx);
    } else {
      return false;
    }
  }
  default:
    break;
  }
  return Value->evaluateAsRelocatable(AddressValue, nullptr, nullptr);
}

RL78MCExpr::ConversionStatus RL78MCExpr::HandleBinaryRelAbsOp(
    const MCExpr *SymWithPossibleOffset, int64_t Abs,
    RL78MCExpr::ConversionStatus &CurrentStatus, bool &NeedsPop,
    SmallVectorImpl<MCFixup> &fixups, MCContext &Ctx, SMLoc Loc, int64_t offset,
    bool IsAdd) {
  if (Abs == 0) {
    // If offset modification is 0, do nothing.
    CurrentStatus.SymWithPossibleOffset = SymWithPossibleOffset;

  } else if (SymWithPossibleOffset) {
    // If it's not yet a nullptr, we can simply add/sub the offset
    if (IsAdd)
      CurrentStatus.SymWithPossibleOffset = MCBinaryExpr::createAdd(
          SymWithPossibleOffset, MCConstantExpr::create(Abs, Ctx), Ctx);
    else
      CurrentStatus.SymWithPossibleOffset = MCBinaryExpr::createSub(
          SymWithPossibleOffset, MCConstantExpr::create(Abs, Ctx), Ctx);
  } else {
    // Otherwise The symbol's value should be on the op stack already, we need
    // to create a symbol for the ABS, a fixup for it and the fixup for the
    // operation
    MCSymbol *AbsSymbol = Ctx.lookupSymbol("@$IMM_" + utostr(Abs));
    if (!AbsSymbol)
      return ConversionStatus();
    AbsSymbol->setUsedInReloc();
    NeedsPop = true;
    CurrentStatus.VariantKind = RL78MCExpr::VK_RL78_IMM_SYM;
    fixups.push_back(MCFixup::create(
        offset,
        RL78MCExpr::create(RL78MCExpr::VK_RL78_IMM_SYM,
                           MCSymbolRefExpr::create(AbsSymbol, Ctx), Ctx),
        (MCFixupKind)RL78::Fixups::fixup_RL78_SYM, Loc));
    fixups.push_back(
        MCFixup::create(offset, MCConstantExpr::create(0, Ctx),
                        (MCFixupKind)(IsAdd ? RL78::Fixups::fixup_RL78_OPadd
                                            : RL78::Fixups::fixup_RL78_OPsub),
                        Loc));
  }
  return CurrentStatus;
}

RL78MCExpr::ConversionStatus RL78MCExpr::ConvertExpressionToFixups(
    const MCExpr *Expression, SmallVectorImpl<MCFixup> &fixups, bool &NeedsPop,
    unsigned FixupFromOp, MCContext &Ctx, SMLoc Loc, int64_t offset,
    RL78::Fixups &DirectFixup) {
  ConversionStatus CurrentStatus;

