ksekimoto/llvm-project/llvm/lib/Target/RL78/MCTargetDesc/RL78MCExpr.cpp
  std::set<RL78MCExpr::VariantKind> VariantSet1 = {};
  std::set<RL78MCExpr::VariantKind> VariantSet2 = {};

  switch (Expression->getKind()) {
  case MCExpr::Constant: {
    const MCConstantExpr *ConstExpr = cast<MCConstantExpr>(Expression);
    return {/*Success*/ true, /*SymWithPossibleOffset*/ nullptr,
            /*Constant*/ ConstExpr->getValue(), /*IsAbsolute*/ true};
  }

  case MCExpr::SymbolRef: {
    const MCSymbolRefExpr *SymExpr = cast<MCSymbolRefExpr>(Expression);
    return {/*Success*/ true, /*SymWithPossibleOffset*/ SymExpr, /*Constant*/ 0,
            /*IsAbsolute*/ false};
  }

  case MCExpr::Target: {
    const RL78MCExpr *TargetExpr = cast<RL78MCExpr>(Expression);
    const MCExpr *SubExpr = TargetExpr->getSubExpr();
    RL78::Fixups Fixup;
    ConversionStatus SubStatus = ConvertExpressionToFixups(
        SubExpr, fixups, NeedsPop, FixupFromOp, Ctx, Loc, offset, DirectFixup);
    CurrentStatus.VariantKind = TargetExpr->getVariantKind();
    CurrentStatus.WasSizeOfPlusStartOf = SubStatus.WasSizeOfPlusStartOf;

    if (!SubStatus.Success ||
        !TargetExpr->getFixupForKind(
            Fixup, SubStatus.VariantKind != RL78MCExpr::VK_RL78_None,
            FixupFromOp))
      return ConversionStatus();

    // FXIME: hack which needs to be deleted when we get rid of the plt.
    // Remove DirectFixup from param list.
    if (CurrentStatus.VariantKind == VK_RL78_FUNCTION) {
      DirectFixup = Fixup;
      const MCSymbolRefExpr *SymExpr = cast<MCSymbolRefExpr>(SubExpr);
      return {/*Success*/ true,
              /*SymWithPossibleOffset*/ SymExpr,
              /*Constant*/ 0,
              /*IsAbsolute*/ false};
    }

    if (SubStatus.IsAbsolute) {
      CurrentStatus.Success = GetAbsValueForVariant(CurrentStatus.VariantKind,
                                                    CurrentStatus.Constant);
      CurrentStatus.IsAbsolute = true;
    } else {

      // TODO: uncomment datapos when we allow it to be relocateable
      const std::set<RL78MCExpr::VariantKind> CurrentExprSet1 = {
          VK_RL78_HIGH, VK_RL78_LOW, VK_RL78_HIGHW, VK_RL78_LOWW};
      const std::set<RL78MCExpr::VariantKind> SubExprSet1 = {
          VK_RL78_MIRHW, VK_RL78_MIRLW, VK_RL78_SMRLW /*, VK_RL78_DATAPOS*/};
      const std::set<RL78MCExpr::VariantKind> CurrentExprSet2 = {
          VK_RL78_MIRHW, VK_RL78_MIRLW, VK_RL78_SMRLW};
      const std::set<RL78MCExpr::VariantKind> SubExprSet2 = {
          VK_RL78_HIGH,  VK_RL78_LOW,   VK_RL78_HIGHW, VK_RL78_LOWW,
          VK_RL78_MIRHW, VK_RL78_MIRLW, VK_RL78_SMRLW /*,  VK_RL78_DATAPOS*/};
      // Note 1. Operation is possible when X is not relocatable terms operated
      // on by MIRHW, MIRLW, SMRLW, or DATAPOS. Note 2. Operation is possible
      // when X is not relocatable terms operated on by HIGH, LOW, HIGHW, LOWW,
      // MIRHW, MIRLW, SMRLW, or DATAPOS.

      if (CurrentExprSet1.find(CurrentStatus.VariantKind) !=
                  CurrentExprSet1.end() &&
              SubExprSet1.find(SubStatus.VariantKind) != SubExprSet1.end() ||
          CurrentExprSet2.find(CurrentStatus.VariantKind) !=
                  CurrentExprSet2.end() &&
              SubExprSet2.find(SubStatus.VariantKind) != SubExprSet2.end())
        return ConversionStatus();

      CurrentStatus.Success = true;
      CurrentStatus.IsAbsolute = false;
      CurrentStatus.AllowOnlyAbsPlusMinus = true;
      if (TargetExpr->getVariantKind() != RL78MCExpr::VK_RL78_SADW) {
        NeedsPop = (CurrentStatus.VariantKind != VK_RL78_FUNCTION);
        fixups.push_back(
            MCFixup::create(offset,
                            SubStatus.VariantKind == RL78MCExpr::VK_RL78_None
                                ? (SubStatus.SymWithPossibleOffset
                                       ? SubStatus.SymWithPossibleOffset
                                       : MCConstantExpr::create(0, Ctx))
                                : MCConstantExpr::create(0, Ctx),
                            (MCFixupKind)Fixup, Loc));
      } else {
        CurrentStatus.SymWithPossibleOffset = SubExpr;
      }
    }
    return CurrentStatus;
  }

  case MCExpr::Binary: {
    const MCBinaryExpr *BinaryExpr =
        static_cast<const MCBinaryExpr *>(Expression);
    MCBinaryExpr::Opcode Op = BinaryExpr->getOpcode();
    ConversionStatus LHS = ConvertExpressionToFixups(
        BinaryExpr->getLHS(), fixups, NeedsPop, FixupFromOp, Ctx, Loc, offset, DirectFixup);
    ConversionStatus RHS = ConvertExpressionToFixups(
        BinaryExpr->getRHS(), fixups, NeedsPop, FixupFromOp, Ctx, Loc, offset, DirectFixup);

    if (!LHS.Success || !RHS.Success || LHS.WasSizeOfPlusStartOf ||
        RHS.WasSizeOfPlusStartOf)
      return ConversionStatus();

    // Based on the CC-RL manual 5.1.14 (Table 5.8)
    // If both are absolute, all operations are permitted.
    if (LHS.IsAbsolute && RHS.IsAbsolute) {
      CurrentStatus.Success = ExecuteOperation(CurrentStatus.Constant,
                                               LHS.Constant, RHS.Constant, Op);
      CurrentStatus.IsAbsolute = true;
      return CurrentStatus;
    } else {
      const MCExpr *SymWithPossibleOffset = LHS.IsAbsolute
                                                ? RHS.SymWithPossibleOffset
                                                : LHS.SymWithPossibleOffset;
      int64_t Abs = LHS.IsAbsolute ? LHS.Constant : RHS.Constant;
      switch (Op) {
      case llvm::MCBinaryExpr::Add:
        if (!LHS.IsAbsolute && !RHS.IsAbsolute) {
          // STARTOF + SIZEOF is permitted as an exception
          if (LHS.VariantKind == RL78MCExpr::VK_RL78_STARTOF &&
                  RHS.VariantKind == RL78MCExpr::VK_RL78_SIZEOF ||
              RHS.VariantKind == RL78MCExpr::VK_RL78_STARTOF &&
                  LHS.VariantKind == RL78MCExpr::VK_RL78_SIZEOF) {
            NeedsPop = true;
            fixups.push_back(MCFixup::create(
                offset, MCConstantExpr::create(0, Ctx),
                (MCFixupKind)RL78::Fixups::fixup_RL78_OPadd, Loc));
            CurrentStatus.Success = true;
            CurrentStatus.WasSizeOfPlusStartOf = true;
            CurrentStatus.VariantKind = RL78MCExpr::VK_RL78_STARTOF;
            return CurrentStatus;
          }
          return ConversionStatus();
        } else {
          // ABS + REL
          // REL + ABS
          CurrentStatus.Success = true;
          return HandleBinaryRelAbsOp(SymWithPossibleOffset, Abs, CurrentStatus,
                                      NeedsPop, fixups, Ctx, Loc, offset, true);
        }
        break;
      case llvm::MCBinaryExpr::Sub:
        if (LHS.IsAbsolute) {
          // ABS - REL
          return ConversionStatus();
        } else if (RHS.IsAbsolute) {
          // REL - ABS
          CurrentStatus.Success = true;
          return HandleBinaryRelAbsOp(SymWithPossibleOffset, Abs, CurrentStatus,
                                      NeedsPop, fixups, Ctx, Loc, offset,
                                      false);
        } else if (LHS.AllowOnlyAbsPlusMinus || RHS.AllowOnlyAbsPlusMinus ||
                   !LHS.SymWithPossibleOffset || !RHS.SymWithPossibleOffset) {
          return ConversionStatus();
        } else {
          // REL - REL
          NeedsPop = true;
          CurrentStatus.Success = true;
          CurrentStatus.VariantKind = VK_RL78_REL_DIFF;
          fixups.push_back(
              MCFixup::create(offset, LHS.SymWithPossibleOffset,
                              (MCFixupKind)RL78::Fixups::fixup_RL78_SYM, Loc));
          fixups.push_back(
              MCFixup::create(offset, RHS.SymWithPossibleOffset,
                              (MCFixupKind)RL78::Fixups::fixup_RL78_SYM, Loc));
          fixups.push_back(MCFixup::create(
              offset, MCConstantExpr::create(0, Ctx),
              (MCFixupKind)RL78::Fixups::fixup_RL78_OPsub, Loc));
          return CurrentStatus;
        }

        break;
      default:
        return ConversionStatus();
        break;
      }
    }

    return ConversionStatus();
  }
  case MCExpr::Unary: {
    const MCUnaryExpr *UnaryExpr = static_cast<const MCUnaryExpr *>(Expression);
    int64_t Res;
    if (UnaryExpr->getOpcode() == MCUnaryExpr::Plus)
      return ConvertExpressionToFixups(UnaryExpr->getSubExpr(), fixups,
                                       NeedsPop, FixupFromOp, Ctx, Loc, offset,
                                       DirectFixup);
    if (UnaryExpr->getSubExpr()->evaluateAsAbsolute(Res)) {
      if (UnaryExpr->getOpcode() == MCUnaryExpr::Minus)
        Res = -Res;
      else if (UnaryExpr->getOpcode() == MCUnaryExpr::Not)
        Res = ~Res;
      else
        return ConversionStatus();
      CurrentStatus.Success = true;
      CurrentStatus.IsAbsolute = true;
      CurrentStatus.Constant = Res;
      return CurrentStatus;
    } else
      return ConversionStatus();
  }
  default:
    break;
  }
  return ConversionStatus();
}


void RL78MCExpr::createFixupsForExpression(const MCExpr *expression,
                                           int64_t offset,
                                           unsigned resultSizeInBits,
                                           SmallVectorImpl<MCFixup> &fixups,
                                           bool IsTopLevelExpression,
                                           unsigned FixupFromOp,
                                           MCContext &Ctx,
                                           SMLoc Loc) {
      RL78::Fixups PopFixup, DirectFixup;
      switch (resultSizeInBits) {
      case 3:
        PopFixup = RL78::fixup_RL78_ABS3U;
        DirectFixup = RL78::fixup_RL78_DIR3U;
        break;
      case 8:
        PopFixup = RL78::fixup_RL78_ABS8U;
        DirectFixup = RL78::fixup_RL78_DIR8U;
        break;
      case 16:
        PopFixup = RL78::fixup_RL78_ABS16U;
        DirectFixup = RL78::fixup_RL78_DIR16U;
        break;
      case 24:
        PopFixup = RL78::fixup_RL78_ABS20U;
        DirectFixup = RL78::fixup_RL78_DIR20U;
        break;
      case 32:
        PopFixup = RL78::fixup_RL78_ABS32U;
        DirectFixup = RL78::fixup_RL78_DIR32U;
        break;
      default:
        llvm_unreachable("Unhandled RL78MCExpr ResultSize");
        break;
      }

      if (FixupFromOp != 0)
        DirectFixup = (RL78::Fixups)FixupFromOp;

      // SymbolRefs can use the DirectFixups, no need for the queue based ones.
      bool NeedsPop = false;

      ConversionStatus Status = ConvertExpressionToFixups(expression, fixups, NeedsPop, FixupFromOp,
                                    Ctx, Loc, offset, DirectFixup);

      // TODO: Loc might be null, leading to an unhelpful error message.
      if (!Status.Success) {
        LLVM_DEBUG(expression->dump());
        Ctx.reportError(Loc, "invalid expression");
        return;
      }

      if (NeedsPop) {
        // ConvertExpressionToFixups takes care of the push fixups.
        fixups.push_back(MCFixup::create(offset, MCConstantExpr::create(0, Ctx),
                                         (MCFixupKind)PopFixup, Loc));
      } else {
        if (!Status.SymWithPossibleOffset) {
          Ctx.reportError(Loc, "error during expression evaluation");
          return;
        }
        fixups.push_back(MCFixup::create(offset, Status.SymWithPossibleOffset,
                                         (MCFixupKind)DirectFixup, Loc));
      }
}